#14 Шатрын хөлөг дээр байрлах 2 тэргийн коардинат x1, y1, x2, y2 хэлбэртэй өгөгдсөн бол биесээ идэх бол true үгүй бол false гэж хэвлэ.
# t1x=input("тэрэг 1 ийн X координат: ")
# t1y=input("тэрэг 1 ийн Y координат: ")
# t2x=input("тэрэг 2 ийн X координат: ")
# t2y=input("тэрэг 2 ийн Y координат: ")
# if t1x==t2x or t1y==t2y:
#     print(True)
# else:
#     print(False)
#15 Шатрын хөлөг дээр байрлах 2 тэмээний коардинат x1, y1, x2, y2 хэлбэртэй өгөгдсөн бол биесээ идэх бол true үгүй бол false гэж хэвлэ.
t1x=input("тэмээ 1 ийн X координат: ")
t1y=input("тэмээ 1 ийн Y координат: ")
t2x=input("тэмээ 2 ийн X координат: ")
t2y=input("тэмээ 2 ийн Y координат: ")
if int(t1x)-int(t2x)==int(t1y)-int(t2y):
    print(True)
else:
    print(False)